'use strict';

var list = [
    {id : 447, title : "钦州的白海豚——生命之歌（下）", dur : "18", time : "2021/8/24", desc : "本期书本旅行团出海追寻中华白海豚。由于中华白海豚时常在水下游十多分钟才到水面换气，所以想要在茫茫大海上遇见它们，是要看运气的。在看到中华白海豚的时候，要降低声音，保持相对安静。中华白海豚还藏着啥秘密？更多精彩，敬请收看。"},
    {id : 448, title : "钦州的白海豚——家园之恋", dur : "18", time : "2021/8/25", desc : "三娘湾到底有什么魅力，让中华白海豚把这里当成了世代繁衍的家园？《钦州的白海豚》一书中有这样一句话引起了大家的注意：涨潮的时候，这里是海；退潮的时候，这里是众多物种清点收获的田园。受这句话的启发，书本旅行团决定去赶海。"}
];

function GetData(id) {
    for(var i=0; i<list.length; i++)
    {
        if (list[i].id == id)
        {
            return list[i];
        }
    }

    return null;
}

window.GetData = GetData;
